{
  "name": "Eddy",
  "headerTaglineOne": "Howdy 👋",
  "headerTaglineTwo": "I'm Eddy Guerra - curious",
  "headerTaglineThree": "Software, Researcher",
  "headerTaglineFour": "based in Houston, Texas.",
  "showCursor": false,
  "showBlog": true,
  "darkMode": true,
  "showResume": true,
  "socials": [
    {
      "id": "1",
      "title": "Github",
      "link": "https://github.com/eddyguerra"
    },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/eddy-guerra-john-8562381a8/"
    },
    {
      "id": "3",
      "title": "Google Scholars",
      "link": "https://scholar.google.com/citations?user=sb7tUm0AAAAJ&hl=en"
    },
    {
      "id": "4",
      "title": "Blog",
      "link": "/blog"
    },
    {
      "id": "5",
      "title": "Email",
      "link": "mailto:theeddy33@gmail.com"
    }
  ],
  "projects": [
    {
      "id": "1",
      "title": "DSA Buddy",
      "description": "Data Structures and Algorithms course",
      "imageSrc": "/images/pictures/dsa_buddy_logo.jpg" ,
      "url": "https://github.com/eddyguerra/Data-Structures-And-Algorithms"
    },
    {
      "id": "2",
      "title": "Thm2 Weighted Multi-Signature Schnoor Scheme",
      "description": "Cryptographic algorithm implemented with rust using Fri-Commitment Scheme based on Schnoor",
      "imageSrc": "/images/pictures/thm2projectcover.png" ,
      "url": "https://github.com/eddyguerra/Theorem_2_Multi_Party_SS_Algorithm/blob/main/src/main.rs"
    },
    {
      "id": "2",
      "title": "Automated Threat Report Generation Using Natural Language Processing",
      "description": "NLP and Machine Learning program that labels cyber-security threat reports, Achieved 70% precision and 40% recall results on labeling reports",
      "imageSrc": "https://bluegoatcyber.com/wp-content/uploads/2024/04/img_662d2b43e7c76.webp" ,
      "url": "https://nbviewer.org/github/eddyguerra/Machine-Learning-Cyber-Security/blob/main/Chi%20Square%20Linear%20100%20threshold.ipynb"
    }

  ],
  "publications": [
    {
      "title": "Poster: Unraveling Reward Functions for Head-to-Head Autonomous Racing in AWS DeepRacer",
      "authors": "Allen Tian, Eddy Guerra John, and Kecheng Yang",
      "details": "Proceedings of the 24th International Symposium on Theory, Algorithmic Foundations, and Protocol Design for Mobile Networks and Mobile Computing (MobiHoc), as part of the 8th National Workshop for REU Research in Networking and Systems (REUNS), pp. 592–594, October 2023.",
      "link": "https://userweb.cs.txstate.edu/~k_y47/webpage/pubs/reuns23.pdf"
    }
  ],
  "services": [
    {
      "id": "1",
      "title": "Research",
      "description": "I conduct computer science research, focusing on the development and exploration of innovative algorithms and technologies."
    },
    {
      "id": "2",
      "title": "Algorithm Optimization",
      "description": "With my experience in developing algorithms, I find more efficient solutions that run faster and take up less space."
    },
    {
      "id": "3",
      "title": "Software Design",
      "description": "I build full-stack software solutions using a variety of frameworks, including React, Django, and Next.js, and back-end technologies such as PHP and Firebase. My approach ensures robust, scalable, and efficient applications tailored to meet specific business needs."
    },
    {
      "id": "4",
      "title": "Cloud Computing",
      "description": "I have extensive experience with cloud computing platforms, particularly AWS, enabling me to design and deploy scalable, secure, and cost-effective cloud-based solutions."
    }
  ],
  "aboutpara": "I'm Eddy Guerra John, a dedicated Computer Science student at the University of Houston-Downtown, specializing in software engineering. My journey has taken me through internships at top institutions, including the University of California, Berkeley, where I developed and optimized cryptographic algorithms, and NSF REU programs, where I honed my skills in machine learning and cybersecurity. My passion lies in building efficient, scalable software solutions, with a strong focus on algorithms and system design. I'm committed to pushing the limits of technology and am always excited to take on challenging projects that drive innovation.",
  "resume": {
    "tagline": "👋 I'm a software engineer, Researcher.",
    "description": "Specializing in programming, full-stack development, and algorithm optimization. Passionate about innovation, I work extensively with JavaScript, Python, and Rust to build scalable and efficient solutions. I thrive in research-driven environments that value creativity and problem-solving.",
    "experiences": [
      {
        "id": "1",
        "dates": "June 2024 - Aug 2024",
        "type": "Full Time",
        "position": "Cryptographer at University of California Berkeley",
        "bullets": "Developed and coded a cryptographic multi-signature protocol algorithm under the guidance of a senior \nprofessor, Optimized the commitment scheme within the algorithm reducing operational costs by minimizing the number \nof necessary operations  "
      },
      {
        "id": "2",
        "dates": "July 2023 - March 2023",
        "type": "Full Time",
        "position": "Edge Computing and Machine Learning Research Intern at Texas State University",
        "bullets": "Trained and optimized AWS DeepRacer using reinforcement learning algorithms focusing on reward functions \nand performance enhancement, Conducted multi-agent artificial intelligence research on DeepRacer interactions, collaborating on \nimplementation and troubleshooting to improve models, Documented research rigorously achieving successful publication and presentation in Washington D.C  "
      },
      {
        "id": "3",
        "dates": "July 2022 - March 2022",
        "type": "Full Time",
        "position": "Cyber Security and Machine Learning research Intern at New Mexico Institute of Mining and Technology",
        "bullets": "Created a machine learning algorithm that labeled cyber security  \nthreat reports, Wrote an academic paper based on results and findings and presented them at a scientific conference in front of 70 people, Tested various machine learning qualifiers with feature selection methods , Focused on finding the most efficient selection method for getting optimal results   "
      }
    ],
    "education": {
      "universityName": "University of Houston, Downtown",
      "universityDate": "2021-2025",
      "universityPara": "I'm a senior Computer Science student with a deep passion for software engineering. Throughout my academic journey, I’ve honed my skills in various programming languages, from C++ to Rust, while tackling complex projects that span machine learning, cryptography, and full-stack development. My experience includes developing efficient algorithms, optimizing code for performance, and implementing secure systems. I’m driven by the challenge of solving real-world problems through innovative technology and am excited to continue pushing the boundaries in software engineering."
    },
    "languages": [
      "Python",
      "Rust",
      "C++",
      "Javascript",
      "Go"
    ],
    "frameworks": [
      "React",
      "Typescript",
      "NodeJs"
    ],
    "others": [
      "Figma",
      "AdobeXD",
      "AWS"
    ]
  }
}
